def get_customs_info(code: str):
    """
    Возвращает информацию о НДС и импортной пошлине.

    Пока используется небольшой справочник.
    Позже заменим его полной базой ТН ВЭД.
    """

    if not code:
        return {
            "vat": "-",
            "duty": "-"
        }

    code = code.replace(" ", "").replace(".", "")

    CUSTOMS = {

        # рубашки
        "6205201000": {
            "vat": "20%",
            "duty": "10%"
        },

        # шарфы
        "6214100000": {
            "vat": "20%",
            "duty": "8%"
        },

        # шапки
        "6505009000": {
            "vat": "20%",
            "duty": "10%"
        }

    }

    return CUSTOMS.get(
        code,
        {
            "vat": "20%",
            "duty": "Уточнить"
        }
    )